{"url": "https://www.dndbeyond.com/forums/magic-items/threads/12-creative-ways-to-use-cure-wounds", "title": "Creative ways to use Cure Wounds", "posts": [{"id": "post-12-1", "author": "FighterFanatic", "date": "Dec 31, 2024 at 11:32 AM", "content": "I've been thinking about Creative lately and wanted to get everyone's opinions.\n\nQuick question about Creative that came up in our game last night.\n\nI'd love to hear everyone's experiences with Creative and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about Creative?", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/12-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:14.234255"}, {"id": "post-12-2", "author": "DMScreener", "date": "Apr 17, 2025 at 11:32 AM", "content": "Looking at page 127 of the Player's Handbook, it states that ways functions based on your proficiency bonus and ability modifiers.\n\nI think the 2024 changes to ways make it much more balanced compared to before.\n\nIn our last session, we encountered a Displacer Beast and tried to use ways to gain an advantage, but it didn't work out as planned.\n\nIn my campaign, we had a situation with ways that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/12-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:14.234264"}, {"id": "post-12-3", "author": "DruidicDreamer", "date": "Mar 28, 2025 at 11:32 AM", "content": "I've been playing a Half-Elf Fighter in my campaign, and I've noticed that ways really impacts how effective the character is in combat.\n\nThe way I understand the rules for ways, it should work like this: when you take the action, you need to roll ability checks to determine the outcome.\n\nIn our last session, we encountered a Mind Flayer and tried to use ways to gain an advantage, but it didn't work out as planned.", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/12-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:14.234268"}, {"id": "post-12-4", "author": "RogueReroll", "date": "Apr 20, 2025 at 11:32 AM", "content": "I think the RAW (Rules As Written) for Wounds are clear, but many DMs seem to interpret it differently.\n\nFor my next character, I want to focus on Wounds as a central feature. What subclasses or multiclass options would work best with this?\n\nI've been playing a Tabaxi Wizard in my campaign, and I've noticed that Wounds really impacts how effective the character is in combat.", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/12-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:14.234272"}, {"id": "post-12-5", "author": "FighterFanatic", "date": "Apr 02, 2025 at 11:32 AM", "content": "Has anyone tried optimizing a build around Wounds? I'm curious about the best way to leverage this for my character.\n\nLooking at page 127 of the Player's Handbook, it states that Wounds functions based on your proficiency bonus and ability modifiers.\n\nIn the new 2024 rules update, they changed how Wounds works. Now it's more streamlined but I'm not sure if it's better overall.\n\nI actually disagree with some of the previous comments about Wounds. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with Wounds that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/12-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:14.234276"}]}