{"url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3005-how-does-wish-work-with-rage?", "title": "How does Wish work with Rage?", "posts": [{"id": "post-3005-1", "author": "CriticalMiss", "date": "Jun 26, 2024 at 11:32 AM", "content": "I've been thinking about Wish lately and wanted to get everyone's opinions.\n\nQuick question about Wish that came up in our game last night.\n\nI'd love to hear everyone's experiences with Wish and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about Wish?", "source": "dndbeyond_forum", "thread_title": "How does Wish work with Rage?", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3005-how-does-wish-work-with-rage?", "processed_at": "2025-04-23T11:32:29.764171"}, {"id": "post-3005-2", "author": "WarlocksWisdom", "date": "Apr 09, 2025 at 11:32 AM", "content": "I've been playing a Tabaxi Ranger in my campaign, and I've noticed that Rage? really impacts how effective the character is in combat.\n\nWe had a hilarious situation where our Bard tried to use Rage? to negotiate with a dragon. It went exactly as you'd expect!\n\nOur table uses a house rule for Rage? where we allow more flexibility in how it's applied. It's been working well so far.\n\nI actually disagree with some of the previous comments about Rage?. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with Rage? that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "How does Wish work with Rage?", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3005-how-does-wish-work-with-rage?", "processed_at": "2025-04-23T11:32:29.764175"}, {"id": "post-3005-3", "author": "BardTales", "date": "Mar 25, 2025 at 11:32 AM", "content": "The best campaign moment I ever had involved creative use of work to solve what seemed like an impossible puzzle.\n\nFor my next character, I want to focus on work as a central feature. What subclasses or multiclass options would work best with this?\n\nI think the RAW (Rules As Written) for work are clear, but many DMs seem to interpret it differently.", "source": "dndbeyond_forum", "thread_title": "How does Wish work with Rage?", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3005-how-does-wish-work-with-rage?", "processed_at": "2025-04-23T11:32:29.764177"}]}