{"url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "title": "Opinion on new 2024 rules for flanking", "posts": [{"id": "post-1014-1", "author": "DungeonMasterDave", "date": "Jan 26, 2025 at 11:32 AM", "content": "I've been thinking about flanking lately and wanted to get everyone's opinions.\n\nQuick question about flanking that came up in our game last night.\n\nThe rules for flanking seem a bit ambiguous to me. On page 123 it states one thing, but then on page 145 it seems to contradict that. How do you interpret this?\n\nWhat do you all think? Has anyone else had similar questions about flanking?", "source": "dndbeyond_forum", "thread_title": "Opinion on new 2024 rules for flanking", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "processed_at": "2025-04-23T11:32:20.625824"}, {"id": "post-1014-2", "author": "SorcerousSally", "date": "Apr 03, 2025 at 11:32 AM", "content": "In our last session, we encountered a Lich and tried to use rules to gain an advantage, but it didn't work out as planned.\n\nI think the 2024 changes to rules make it much more balanced compared to before.\n\nHow do other DMs balance encounters that involve rules? I find it either makes combats too easy or too difficult.\n\nIn my campaign, we had a situation with rules that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Opinion on new 2024 rules for flanking", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "processed_at": "2025-04-23T11:32:20.625834"}, {"id": "post-1014-3", "author": "RangerDanger", "date": "Apr 15, 2025 at 11:32 AM", "content": "How do other DMs balance encounters that involve flanking? I find it either makes combats too easy or too difficult.\n\nIn our last session, we encountered a Gelatinous Cube and tried to use flanking to gain an advantage, but it didn't work out as planned.\n\nI think the 2024 changes to flanking make it much more balanced compared to before.\n\nI actually disagree with some of the previous comments about flanking. Based on my experience, it works differently.", "source": "dndbeyond_forum", "thread_title": "Opinion on new 2024 rules for flanking", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "processed_at": "2025-04-23T11:32:20.625839"}, {"id": "post-1014-4", "author": "DungeonMasterDave", "date": "Mar 28, 2025 at 11:32 AM", "content": "In the new 2024 rules update, they changed how Opinion works. Now it's more streamlined but I'm not sure if it's better overall.\n\nMy DM interprets Opinion differently than the rules as written. How do you all handle this at your tables?\n\nHow do other DMs balance encounters that involve Opinion? I find it either makes combats too easy or too difficult.", "source": "dndbeyond_forum", "thread_title": "Opinion on new 2024 rules for flanking", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "processed_at": "2025-04-23T11:32:20.625843"}, {"id": "post-1014-5", "author": "CriticalMiss", "date": "Apr 05, 2025 at 11:32 AM", "content": "I've been playing a Gnome Monk in my campaign, and I've noticed that flanking really impacts how effective the character is in combat.\n\nMy DM interprets flanking differently than the rules as written. How do you all handle this at your tables?\n\nHas anyone tried optimizing a build around flanking? I'm curious about the best way to leverage this for my character.\n\nI actually disagree with some of the previous comments about flanking. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with flanking that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Opinion on new 2024 rules for flanking", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "processed_at": "2025-04-23T11:32:20.625847"}, {"id": "post-1014-6", "author": "DruidicDreamer", "date": "Apr 14, 2025 at 11:32 AM", "content": "For my next character, I want to focus on Opinion as a central feature. What subclasses or multiclass options would work best with this?\n\nWe had a hilarious situation where our Bard tried to use Opinion to negotiate with a dragon. It went exactly as you'd expect!\n\nI've been playing a Tiefling Ranger in my campaign, and I've noticed that Opinion really impacts how effective the character is in combat.\n\nIn my campaign, we had a situation with Opinion that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Opinion on new 2024 rules for flanking", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1014-opinion-on-new-2024-rules-for-flanking", "processed_at": "2025-04-23T11:32:20.625850"}]}