{"url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3019-bard-subclass-tier-list-discussion", "title": "Bard subclass tier list discussion", "posts": [{"id": "post-3019-1", "author": "RulesMaster", "date": "Aug 05, 2024 at 11:32 AM", "content": "I've been thinking about Bard lately and wanted to get everyone's opinions.\n\nQuick question about Bard that came up in our game last night.\n\nI'd love to hear everyone's experiences with Bard and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about Bard?", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3019-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:33.706234"}, {"id": "post-3019-2", "author": "CriticalMiss", "date": "Apr 19, 2025 at 11:32 AM", "content": "Looking at page 127 of the Player's Handbook, it states that discussion functions based on your proficiency bonus and ability modifiers.\n\nThe way I understand the rules for discussion, it should work like this: when you take the action, you need to roll ability checks to determine the outcome.\n\nI think the RAW (Rules As Written) for discussion are clear, but many DMs seem to interpret it differently.", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3019-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:33.706243"}, {"id": "post-3019-3", "author": "RogueReroll", "date": "Apr 11, 2025 at 11:32 AM", "content": "I think the 2024 changes to discussion make it much more balanced compared to before.\n\nWhen DMing, I like to use discussion as a way to create interesting challenges for my players.\n\nI've been playing a Half-Orc Paladin in my campaign, and I've noticed that discussion really impacts how effective the character is in combat.\n\nI actually disagree with some of the previous comments about discussion. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with discussion that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3019-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:33.706247"}, {"id": "post-3019-4", "author": "NaturalTwenty", "date": "Apr 14, 2025 at 11:32 AM", "content": "In the new 2024 rules update, they changed how list works. Now it's more streamlined but I'm not sure if it's better overall.\n\nHas anyone tried optimizing a build around list? I'm curious about the best way to leverage this for my character.\n\nThe best campaign moment I ever had involved creative use of list to solve what seemed like an impossible puzzle.\n\nIn my campaign, we had a situation with list that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3019-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:33.706251"}]}