{"url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3018-creative-ways-to-use-cure-wounds", "title": "Creative ways to use Cure Wounds", "posts": [{"id": "post-3018-1", "author": "NaturalTwenty", "date": "Aug 26, 2024 at 11:32 AM", "content": "I've been thinking about ways lately and wanted to get everyone's opinions.\n\nQuick question about ways that came up in our game last night.\n\nI'd love to hear everyone's experiences with ways and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about ways?", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3018-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:33.458120"}, {"id": "post-3018-2", "author": "PaladinPete", "date": "Apr 19, 2025 at 11:32 AM", "content": "For my next character, I want to focus on Cure as a central feature. What subclasses or multiclass options would work best with this?\n\nThe best campaign moment I ever had involved creative use of Cure to solve what seemed like an impossible puzzle.\n\nI think the 2024 changes to Cure make it much more balanced compared to before.\n\nI actually disagree with some of the previous comments about Cure. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with Cure that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3018-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:33.458127"}, {"id": "post-3018-3", "author": "ClericofChaos", "date": "Apr 11, 2025 at 11:32 AM", "content": "How do other DMs balance encounters that involve Creative? I find it either makes combats too easy or too difficult.\n\nI think the RAW (Rules As Written) for Creative are clear, but many DMs seem to interpret it differently.\n\nHas anyone tried optimizing a build around Creative? I'm curious about the best way to leverage this for my character.\n\nI actually disagree with some of the previous comments about Creative. Based on my experience, it works differently.", "source": "dndbeyond_forum", "thread_title": "Creative ways to use Cure Wounds", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3018-creative-ways-to-use-cure-wounds", "processed_at": "2025-04-23T11:32:33.458130"}]}