{"url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "title": "Help optimizing my Warlock build", "posts": [{"id": "post-1012-1", "author": "InitiativeTracker", "date": "Oct 23, 2024 at 11:32 AM", "content": "I've been thinking about optimizing lately and wanted to get everyone's opinions.\n\nQuick question about optimizing that came up in our game last night.\n\nI'm trying to create an optimized character focused on optimizing. What race/class/feat combinations would you recommend?\n\nWhat do you all think? Has anyone else had similar questions about optimizing?", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113891"}, {"id": "post-1012-2", "author": "WizardlyWisdom", "date": "Mar 31, 2025 at 11:32 AM", "content": "I've been playing a Half-Orc Bard in my campaign, and I've noticed that build really impacts how effective the character is in combat.\n\nIn our last session, we encountered a Basilisk and tried to use build to gain an advantage, but it didn't work out as planned.\n\nWhen DMing, I like to use build as a way to create interesting challenges for my players.\n\nI actually disagree with some of the previous comments about build. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with build that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113895"}, {"id": "post-1012-3", "author": "WarlocksWisdom", "date": "Apr 08, 2025 at 11:32 AM", "content": "I've been playing a Half-Elf Barbarian in my campaign, and I've noticed that optimizing really impacts how effective the character is in combat.\n\nOur table uses a house rule for optimizing where we allow more flexibility in how it's applied. It's been working well so far.\n\nI think the 2024 changes to optimizing make it much more balanced compared to before.\n\nI actually disagree with some of the previous comments about optimizing. Based on my experience, it works differently.", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113897"}, {"id": "post-1012-4", "author": "InitiativeTracker", "date": "Apr 03, 2025 at 11:32 AM", "content": "I think the RAW (Rules As Written) for build are clear, but many DMs seem to interpret it differently.\n\nLooking at page 127 of the Player's Handbook, it states that build functions based on your proficiency bonus and ability modifiers.\n\nThe best campaign moment I ever had involved creative use of build to solve what seemed like an impossible puzzle.", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113899"}, {"id": "post-1012-5", "author": "FighterFanatic", "date": "Apr 22, 2025 at 11:32 AM", "content": "How do other DMs balance encounters that involve Help? I find it either makes combats too easy or too difficult.\n\nWe had a hilarious situation where our Bard tried to use Help to negotiate with a dragon. It went exactly as you'd expect!\n\nI think the 2024 changes to Help make it much more balanced compared to before.\n\nIn my campaign, we had a situation with Help that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113901"}, {"id": "post-1012-6", "author": "PaladinPete", "date": "Mar 29, 2025 at 11:32 AM", "content": "I've been playing a Tiefling Druid in my campaign, and I've noticed that Help really impacts how effective the character is in combat.\n\nMy DM interprets Help differently than the rules as written. How do you all handle this at your tables?\n\nWhen DMing, I like to use Help as a way to create interesting challenges for my players.\n\nI actually disagree with some of the previous comments about Help. Based on my experience, it works differently.", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113903"}, {"id": "post-1012-7", "author": "RogueReroll", "date": "Mar 28, 2025 at 11:32 AM", "content": "The best campaign moment I ever had involved creative use of optimizing to solve what seemed like an impossible puzzle.\n\nHow do other DMs balance encounters that involve optimizing? I find it either makes combats too easy or too difficult.\n\nIn our last session, we encountered a Gelatinous Cube and tried to use optimizing to gain an advantage, but it didn't work out as planned.", "source": "dndbeyond_forum", "thread_title": "Help optimizing my Warlock build", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1012-help-optimizing-my-warlock-build", "processed_at": "2025-04-23T11:32:20.113905"}]}