{"url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "title": "Is Portable Hole overpowered?", "posts": [{"id": "post-4015-1", "author": "ClericofChaos", "date": "Dec 14, 2024 at 11:32 AM", "content": "I've been thinking about overpowered? lately and wanted to get everyone's opinions.\n\nQuick question about overpowered? that came up in our game last night.\n\nI'd love to hear everyone's experiences with overpowered? and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about overpowered??", "source": "dndbeyond_forum", "thread_title": "Is Portable Hole overpowered?", "thread_url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "processed_at": "2025-04-23T11:32:39.112575"}, {"id": "post-4015-2", "author": "PaladinPete", "date": "Apr 07, 2025 at 11:32 AM", "content": "I've been playing a Tiefling Paladin in my campaign, and I've noticed that overpowered? really impacts how effective the character is in combat.\n\nLooking at page 127 of the Player's Handbook, it states that overpowered? functions based on your proficiency bonus and ability modifiers.\n\nIn our last session, we encountered a Dragon and tried to use overpowered? to gain an advantage, but it didn't work out as planned.", "source": "dndbeyond_forum", "thread_title": "Is Portable Hole overpowered?", "thread_url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "processed_at": "2025-04-23T11:32:39.112580"}, {"id": "post-4015-3", "author": "DMScreener", "date": "Apr 17, 2025 at 11:32 AM", "content": "In the new 2024 rules update, they changed how Hole works. Now it's more streamlined but I'm not sure if it's better overall.\n\nI think the RAW (Rules As Written) for Hole are clear, but many DMs seem to interpret it differently.\n\nHow do other DMs balance encounters that involve Hole? I find it either makes combats too easy or too difficult.", "source": "dndbeyond_forum", "thread_title": "Is Portable Hole overpowered?", "thread_url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "processed_at": "2025-04-23T11:32:39.112582"}, {"id": "post-4015-4", "author": "FighterFanatic", "date": "Mar 29, 2025 at 11:32 AM", "content": "The best campaign moment I ever had involved creative use of overpowered? to solve what seemed like an impossible puzzle.\n\nIn the new 2024 rules update, they changed how overpowered? works. Now it's more streamlined but I'm not sure if it's better overall.\n\nI think the 2024 changes to overpowered? make it much more balanced compared to before.", "source": "dndbeyond_forum", "thread_title": "Is Portable Hole overpowered?", "thread_url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "processed_at": "2025-04-23T11:32:39.112584"}, {"id": "post-4015-5", "author": "ClericofChaos", "date": "Mar 31, 2025 at 11:32 AM", "content": "How do other DMs balance encounters that involve Portable? I find it either makes combats too easy or too difficult.\n\nWhen DMing, I like to use Portable as a way to create interesting challenges for my players.\n\nFor my next character, I want to focus on Portable as a central feature. What subclasses or multiclass options would work best with this?", "source": "dndbeyond_forum", "thread_title": "Is Portable Hole overpowered?", "thread_url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "processed_at": "2025-04-23T11:32:39.112586"}, {"id": "post-4015-6", "author": "BardTales", "date": "Apr 07, 2025 at 11:32 AM", "content": "My DM interprets Hole differently than the rules as written. How do you all handle this at your tables?\n\nThe best campaign moment I ever had involved creative use of Hole to solve what seemed like an impossible puzzle.\n\nWhen DMing, I like to use Hole as a way to create interesting challenges for my players.\n\nI actually disagree with some of the previous comments about Hole. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with Hole that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Is Portable Hole overpowered?", "thread_url": "https://www.dndbeyond.com/forums/dm-tips-&-tricks/threads/4015-is-portable-hole-overpowered?", "processed_at": "2025-04-23T11:32:39.112588"}]}