{"url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "title": "DMing advice for new campaigns", "posts": [{"id": "post-1001-1", "author": "PaladinPete", "date": "Aug 25, 2024 at 11:32 AM", "content": "I've been thinking about campaigns lately and wanted to get everyone's opinions.\n\nQuick question about campaigns that came up in our game last night.\n\nI'd love to hear everyone's experiences with campaigns and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about campaigns?", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852272"}, {"id": "post-1001-2", "author": "CriticalElf", "date": "Apr 13, 2025 at 11:32 AM", "content": "I've been playing a Half-Orc Wizard in my campaign, and I've noticed that campaigns really impacts how effective the character is in combat.\n\nIn our last session, we encountered a Tarrasque and tried to use campaigns to gain an advantage, but it didn't work out as planned.\n\nHas anyone tried optimizing a build around campaigns? I'm curious about the best way to leverage this for my character.\n\nIn my campaign, we had a situation with campaigns that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852281"}, {"id": "post-1001-3", "author": "BardTales", "date": "Apr 18, 2025 at 11:32 AM", "content": "When DMing, I like to use advice as a way to create interesting challenges for my players.\n\nWe had a hilarious situation where our Bard tried to use advice to negotiate with a dragon. It went exactly as you'd expect!\n\nI think the RAW (Rules As Written) for advice are clear, but many DMs seem to interpret it differently.\n\nI actually disagree with some of the previous comments about advice. Based on my experience, it works differently.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852285"}, {"id": "post-1001-4", "author": "CriticalElf", "date": "Apr 04, 2025 at 11:32 AM", "content": "I've been playing a Dragonborn Paladin in my campaign, and I've noticed that advice really impacts how effective the character is in combat.\n\nLooking at page 127 of the Player's Handbook, it states that advice functions based on your proficiency bonus and ability modifiers.\n\nMy DM interprets advice differently than the rules as written. How do you all handle this at your tables?", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852289"}, {"id": "post-1001-5", "author": "DMScreener", "date": "Apr 13, 2025 at 11:32 AM", "content": "We had a hilarious situation where our Bard tried to use DMing to negotiate with a dragon. It went exactly as you'd expect!\n\nIn our last session, we encountered a Dragon and tried to use DMing to gain an advantage, but it didn't work out as planned.\n\nIn the new 2024 rules update, they changed how DMing works. Now it's more streamlined but I'm not sure if it's better overall.\n\nIn my campaign, we had a situation with DMing that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852293"}, {"id": "post-1001-6", "author": "PaladinPete", "date": "Apr 08, 2025 at 11:32 AM", "content": "Looking at page 127 of the Player's Handbook, it states that campaigns functions based on your proficiency bonus and ability modifiers.\n\nHow do other DMs balance encounters that involve campaigns? I find it either makes combats too easy or too difficult.\n\nFor my next character, I want to focus on campaigns as a central feature. What subclasses or multiclass options would work best with this?\n\nI actually disagree with some of the previous comments about campaigns. Based on my experience, it works differently.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852296"}, {"id": "post-1001-7", "author": "BarbarianBob", "date": "Apr 08, 2025 at 11:32 AM", "content": "The way I understand the rules for advice, it should work like this: when you take the action, you need to roll ability checks to determine the outcome.\n\nLooking at page 127 of the Player's Handbook, it states that advice functions based on your proficiency bonus and ability modifiers.\n\nI've been playing a Aasimar Wizard in my campaign, and I've noticed that advice really impacts how effective the character is in combat.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852300"}, {"id": "post-1001-8", "author": "MonkeyBusinessDM", "date": "Apr 13, 2025 at 11:32 AM", "content": "I've been playing a Elf Wizard in my campaign, and I've noticed that campaigns really impacts how effective the character is in combat.\n\nMy DM interprets campaigns differently than the rules as written. How do you all handle this at your tables?\n\nIn the new 2024 rules update, they changed how campaigns works. Now it's more streamlined but I'm not sure if it's better overall.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852304"}, {"id": "post-1001-9", "author": "CriticalMiss", "date": "Mar 30, 2025 at 11:32 AM", "content": "I've been playing a Tiefling Warlock in my campaign, and I've noticed that advice really impacts how effective the character is in combat.\n\nHas anyone tried optimizing a build around advice? I'm curious about the best way to leverage this for my character.\n\nHow do other DMs balance encounters that involve advice? I find it either makes combats too easy or too difficult.", "source": "dndbeyond_forum", "thread_title": "DMing advice for new campaigns", "thread_url": "https://www.dndbeyond.com/forums/monster-tactics/threads/1001-dming-advice-for-new-campaigns", "processed_at": "2025-04-23T11:32:16.852307"}]}