{"url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3014-bard-subclass-tier-list-discussion", "title": "Bard subclass tier list discussion", "posts": [{"id": "post-3014-1", "author": "DruidicDreamer", "date": "Apr 24, 2024 at 11:32 AM", "content": "I've been thinking about Bard lately and wanted to get everyone's opinions.\n\nQuick question about Bard that came up in our game last night.\n\nI'd love to hear everyone's experiences with Bard and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about Bard?", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3014-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:32.246558"}, {"id": "post-3014-2", "author": "BarbarianBob", "date": "Apr 16, 2025 at 11:32 AM", "content": "How do other DMs balance encounters that involve subclass? I find it either makes combats too easy or too difficult.\n\nI think the 2024 changes to subclass make it much more balanced compared to before.\n\nThe way I understand the rules for subclass, it should work like this: when you take the action, you need to roll ability checks to determine the outcome.\n\nIn my campaign, we had a situation with subclass that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3014-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:32.246566"}, {"id": "post-3014-3", "author": "ClericofChaos", "date": "Mar 29, 2025 at 11:32 AM", "content": "My DM interprets list differently than the rules as written. How do you all handle this at your tables?\n\nIn our last session, we encountered a Beholder and tried to use list to gain an advantage, but it didn't work out as planned.\n\nThe way I understand the rules for list, it should work like this: when you take the action, you need to roll ability checks to determine the outcome.\n\nIn my campaign, we had a situation with list that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Bard subclass tier list discussion", "thread_url": "https://www.dndbeyond.com/forums/spell-discussions/threads/3014-bard-subclass-tier-list-discussion", "processed_at": "2025-04-23T11:32:32.246571"}]}