{"url": "https://www.dndbeyond.com/forums/magic-items/threads/10-character-concept:-elf-ranger", "title": "Character concept: Elf Ranger", "posts": [{"id": "post-10-1", "author": "RangerDanger", "date": "Sep 25, 2024 at 11:32 AM", "content": "I've been thinking about concept: lately and wanted to get everyone's opinions.\n\nQuick question about concept: that came up in our game last night.\n\nI'd love to hear everyone's experiences with concept: and how it's worked in your games.\n\nWhat do you all think? Has anyone else had similar questions about concept:?", "source": "dndbeyond_forum", "thread_title": "Character concept: Elf Ranger", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/10-character-concept:-elf-ranger", "processed_at": "2025-04-23T11:32:13.720851"}, {"id": "post-10-2", "author": "FighterFanatic", "date": "Apr 01, 2025 at 11:32 AM", "content": "I've been playing a Dwarf Barbarian in my campaign, and I've noticed that concept: really impacts how effective the character is in combat.\n\nThe best campaign moment I ever had involved creative use of concept: to solve what seemed like an impossible puzzle.\n\nIn our last session, we encountered a Tarrasque and tried to use concept: to gain an advantage, but it didn't work out as planned.\n\nI actually disagree with some of the previous comments about concept:. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with concept: that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Character concept: Elf Ranger", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/10-character-concept:-elf-ranger", "processed_at": "2025-04-23T11:32:13.720857"}, {"id": "post-10-3", "author": "DruidicDreamer", "date": "Apr 16, 2025 at 11:32 AM", "content": "Our table uses a house rule for Character where we allow more flexibility in how it's applied. It's been working well so far.\n\nFor my next character, I want to focus on Character as a central feature. What subclasses or multiclass options would work best with this?\n\nMy DM interprets Character differently than the rules as written. How do you all handle this at your tables?\n\nI actually disagree with some of the previous comments about Character. Based on my experience, it works differently.\n\nIn my campaign, we had a situation with Character that played out really well. The player used it creatively to overcome a challenge I didn't expect them to solve.", "source": "dndbeyond_forum", "thread_title": "Character concept: Elf Ranger", "thread_url": "https://www.dndbeyond.com/forums/magic-items/threads/10-character-concept:-elf-ranger", "processed_at": "2025-04-23T11:32:13.720859"}]}