[
  {
    "post_id": "q-210474",
    "author": "Jorge C&#243;rdoba",
    "timestamp": "2024-02-11T03:48:21",
    "text": "I have a very long lived 5e campaign with a set of 4 characters that we are considering migrating to Pathfinder 2e. The campaign itself is homebrew so there's no need to migrate the adventure itself (as I'm making most of it as I go I plan on simply present the challenges based on PF Monsters and enemies). Currently my players are Level 10. My plan was to simply have the player remake their characters from scratch on Pathfinder , start at level 1 and progress their character as they see fit even if it doesn't match 1 to 1 their 5e character, then simply use the rules for magic items from PF2 so they get an \"equivalent\" of magic items that is appropriate for the PF version. The only homebrew things to take into account is: They all got access to haste spell as a free action one per long rest as a result of some magic experiments they were subjected to (this is the base for the adventure) They all got some boons to their base stats (+1 to some random stat) which is a bit more difficult for me to actually translate. Those were meant to simply increase the epicness of the characters and the campaign and I have been adjusting CR of encounters to account for this and still make a challenge. From the migration onwards the plan is to simply fully embrace PF2 rules and evolve the adventure as if we had always played there. Any advice or things I should take into consideration when planning the migration?",
    "thread_id": "rpg-se-210474",
    "thread_title": "Migrate D&amp;D 5e home made campaign to Pathfinder 2e",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/210474/migrate-dd-5e-home-made-campaign-to-pathfinder-2e",
    "title": "Migrate D&amp;D 5e home made campaign to Pathfinder 2e",
    "post_type": "question",
    "score": 7
  },
  {
    "post_id": "a-210484",
    "author": "brandon",
    "timestamp": "2024-02-11T10:29:57",
    "text": "Remaking Characters One difference worth highlighting is that the characters will likely have some means to fully heal between serious encounters without spending daily resources, provided they have some time. If a character has master proficiency in Medicine and the Continual Recovery and Ward Medic feats they can restore ~20–30 Hit Points to 4 creatures every 10 minutes by Treating Wounds , likely restoring the entire 10th-level party with an hour or less between battles depending on injuries/rolls. Other methods exist such as a champion's lay on hands or an chirurgeon alchemist's persistent infusions for healing elixirs, but they'll generally be able to take some time to patch up between combats, overlapping with activities like Identifying new items or Refocusing to regain focus points. If the remade characters don't take these abilities or proficiency in Medicine, you might want to suggest otherwise. Magic Items Characters are expected to have more magic items in Pathfinder 2e compared to D&D 5e, with most characters having 6 substantial permanent items and some lesser items or consumables. Good choices for remade characters would include magic weapons(s) and armor (with any property runes like flaming as separate items), and items that grant bonuses to the character's skills (see item bonuses for each skill on the SRD). Homebrew They all got access to haste spell as a free action one per long rest as a result of some magic experiments they were subjected to (this is the base for the adventure) This is very potent, but would otherwise be fine to directly include. You could give the free action ability a trigger to activate before a character gains their actions at the start of their turn , so using it allows them to gain the extra action on that turn. Otherwise a way to include this ability naturally using the rules would be to have it as a Deviant Ability , allowing it to be used more regularly but risking some substantial backlash for whatever else this magic experiment might be doing to them. They all got some boons to their base stats (+1 to some random stat) which is a bit more difficult for me to actually translate. This could be translated as some free additional ability boosts beyond the ones granted with character creation and at 5th/10th level. Following the no-stacking limitation (each boost must be to a different ability) of these other boost opportunities should prevent this from being wildly imbalanced, though still quite strong. Those were meant to simply increase the epicness of the characters and the campaign and I have been adjusting CR of encounters to account for this and still make a challenge. I'd recommend against increasing encounter difficulty initially, and testing how the characters perform against the standard balancing of Pathfinder 2e. Things are much tighter in regards to difficulty, with severe and extreme encounters easily able to overwhelm parties especially if they're new to the system and not familiar with their options for more dynamic battle strategies.",
    "thread_id": "rpg-se-210474",
    "thread_title": "Migrate D&amp;D 5e home made campaign to Pathfinder 2e",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/210474/migrate-dd-5e-home-made-campaign-to-pathfinder-2e#210484",
    "title": "Migrate D&amp;D 5e home made campaign to Pathfinder 2e",
    "post_type": "answer",
    "score": 4,
    "is_accepted": true
  },
  {
    "post_id": "q-165473",
    "author": "Jeffrey Witty",
    "timestamp": "2020-02-26T12:57:21",
    "text": "I know this is abit of a \"wide net\" question. I am currently switching over to 5e from years of activity (after 4e was released) from 3.5e.. The mechanics of 5e seem secondary while the role-playing seems primary from my experience in about 10 AL games. I've spent the last 13 years or so away from TT-RPG I desire highly mechanical play with other players that are also \"rules to their letter experts,\" not self-styled \"RP-actors\". I have played D&D:Basic, Advanced, 2e, 3.5e, 4e (twice), 5e (about 10 times) I have not played any version of Pathfinder. What are the major differences in style and system between D&D 5e and Pathfinder 2e?",
    "thread_id": "rpg-se-165473",
    "thread_title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/165473/what-are-the-major-differences-in-style-and-system-between-dd-5e-and-pathfinder",
    "title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "post_type": "question",
    "score": 26
  },
  {
    "post_id": "a-165476",
    "author": "KRyan",
    "timestamp": "2020-02-26T14:08:58",
    "text": "D&D 5e has been optimized to make it simple to learn and play, which is what you are reacting to. Its design reflects the fracturing of the D&D fanbase after 4e, and to a certain extent embraces a more “old-school” (read: 2e or earlier) playstyle in which the rules are much more nebulous, fluid, and handled ad hoc by the DM. This both makes it simpler to learn and play (since there aren’t rules to learn, you just have to trust the DM’s judgment), and also mollifies some of the critics of 4e (and, to an extent, 3e) in an effort to reunite the fanbase. The downside of this is that more of the experience is riding on the DM’s expertise and judgment, and the players are often not left with a lot of surety in terms of how things will work from one DM to another. That makes it difficult to plan on things as a player, and can in some cases reduce player agency. Pathfinder 1e was a spin-off of D&D 3.5e, and is for the most part identical in its foundations to that system. 1 D&D 3.5e was likely never intended to be, but in some ways it was a departure from 2e when it comes to the subject of “rules vs. rulings,” as the more precise language gave many readers the basic assumption that things would generally go mostly by the rules and that exceptions would be, well, exceptional. Pathfinder inherited this heritage, though Paizo tried to repudiate it, and despite the fact that, like 5e, Pathfinder was in large part a reaction against D&D 4e, which was the system that most truly embraced the “rules” side of “rules vs. rulings.” With Pathfinder 2e, Paizo has seemed to, at least somewhat, more fully embrace this “rules over rulings” ethos, in a way they largely didn’t with Pathfinder. And, in ways that are probably not coincidental but I’m not sure were planned, Pathfinder 2e is actually reminiscent of D&D 4e . The lists of class feats feel very similar to 4e’s lists of powers for each class, and the use of tags is very similar to 4e. Even the design and layout of the book feels like 4e—the little action diamonds just look like 4e’s heavy usage of the ♦ character in power descriptions, and the nature of the one-two-or-three diamonds is similar to 4e’s color coding by power availability (at-will, encounter, daily). Paizo has also discussed PF 2e in these terms, describing their audience as being more technically-minded, more interested in the rules themselves, as being interested in digging into them and combining them in creative ways. It would seem that these appearances are not merely superficial, and possibly unlike Pathfinder 1e, not unintentional. The long and short of it is, yes, it is fairly likely that Pathfinder 2e is at least intended to cater more to your tastes than D&D 5e is. You may also want to take a look at D&D 4e—which, as I mentioned, probably wins overall in “rules over rulings,” even more so than Pathfinder 2e. Pathfinder 1e’s Core Rulebook and Bestiary are based on, and in most things have the same rules as, 3.5e’s Player’s Handbook , Dungeon Master’s Guide , and Monster Manual . Pathfinder could not reference 3.5e’s supplements (as they were not open-game content), and of course Pathfinder’s own supplements after Core Rulebook were never available in 3.5e.",
    "thread_id": "rpg-se-165473",
    "thread_title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/165473/what-are-the-major-differences-in-style-and-system-between-dd-5e-and-pathfinder#165476",
    "title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "post_type": "answer",
    "score": 32,
    "is_accepted": false
  },
  {
    "post_id": "a-207786",
    "author": "brandon",
    "timestamp": "2023-08-16T15:59:56",
    "text": "Major Differences in Style One of the biggest differences is the existence of easy and convenient out-of-combat healing, where it's generally expected that Pathfinder 2e parties will take the time to Treat Wounds between encounters. This free healing means that without time pressure most encounters begin with the party at full health, and encounters are balanced around this. Other party members also have the option to Refocus and replenish some abilities or Identify items during this time so it's not just the healer patching everyone up. Another difference is the prevalence of Secret Checks for things like Recalling Knowledge or Seeking ; situations where the character rolling wouldn't know how well they did (misremembering a troll's weakness to fire, not finding anything but the room has a deadly trap). In 5e and other editions my experience is that other characters will often attempt those checks as well after knowing that the first character rolled badly. Spells are also much less broadly useful than they are in 5e, with many of the more narrative-challenging spells like resurrect and teleport protected by the uncommon rarity meaning that the GM would need to grant access in some way first. In addition many spells are less able to fully replace proficiency in a skill, such as with the 2nd-rank knock spell only granting a bonus rather than automatically succeeding against mundane locks in 5e. This also contributes to the much easier ability to run high-level games in Pathfinder 2e. On the other hand characters are universally able to specialize and cast certain types of larger-scale spells called rituals in Pathfinder 2e using their skills. A 9th-level barbarain who chooses to gain expert proficiency in the Religion skill could attempt to cast that resurrect spell with the help of a pair of secondary casters aiding with Medicine and Society skill checks, though with odds of something going horribly wrong on a critical failure. Beyond this is another difference in that any character can chose to deeply specialize in any skill, allowing wizards with legendary Athletics to wrestle titans or a cleric with legendary Thievery who could steal the king's worn clothes . While a barbarian or a rogue might be able to specialize further these options are definitively allowed for any character of sufficient level. One thing that might not qualify depending on your definition of style is the availability of all Pathfinder 2e rules in a free officially-supported reference document site the Archives of Nethys . There are definitely similar sites for 5e but in my experience they lack the fullness of free content available here, even with the smaller rules footprint of 5e ( 46 books total vs more than 100 1st-party books ). Major Differences in System Probably the most mentioned difference between the two systems is in action economy, that Pathfinder 2e gives characters 3 actions each turn to spend instead of 5e's action/bonus action/movement. Generally this doesn't change too much but it does allow for characters to make things like 3 attacks a round at all levels of play rather than as an automatic function of class like in 5e, with scaling penalties to balance that option. This particularly plays into the absence of a generic Opportunity Attack for all characters, with Pathfinder 2e fighters and only particularly martially-inclined characters getting it. Paired with the more open action economy this allows characters to freely move around the battlefield without being punished in most cases and makes many dynamic options more viable. Building characters in Pathfinder 2e is much more involved than in 5e, with every level granting new abilities in feats spread across their character. Instead of getting basically everything from your race at level 1 like in 5e you instead choose a heritage and ancestry feat from broad lists based on your chosen ancestry, with characters gaining additional and more powerful ancestry feats every 4 levels. And for more combat-oriented abilities each character gets a class feat with every even level, also allowing for things like multi-classing or taking archetypes that fit a character theme outside of class. Finally there are a host of skill feats also granted on even levels that allow for characters to specialize in particular skills and unlock more unusual options for using them. One interesting option in Pathfinder 2e for a character is the option for versatile heritages, allowing any ancestry like dwarf, leshy , or automaton to also be an aasimar reflecting celestial heritage, and having deep support for that through additional ancestry feat options like gaining a halo or celestial wings . Proficiency is much broader in Pathfinder 2e, with characters having ranks from Untrained (+0) to Legendary (Level+8) proficiency in everything from skills to spells to attacks and AC. Because of this the numbers in Pathfinder 2e are generally much higher than in 5e, with typical level 20 DCs being around 40 rather than 5e's nearly impossible at 30. 5e's advantage and disadvantage mechanics are very easy to use when compared to the larger number of bonuses and penalties used in Pathfinder 2e, though there is a similar ability for advantage that player characters have access to in Hero Points . This allows for players to re-roll a particular check by expending a point, getting one for free each session of gameplay and additional points over the course of the session for acts of heroism/cleverness rewarded by the GM. Tied to this are the Degrees of Success , where most checks in the game have 4 outcomes based on whether it was a Critical Failure, Failure, Success, or Critical Success. 5e has some support for this in things like attack rolls on natural 20s, but in Pathfinder 2e you can also achieve a critical success by getting a result 10 higher than the DC. With the heightened proficiency this means that higher-level characters are much more dangerous to lower-level ones as a substantial portion of their abilities and attacks will crit while the inverse is true for those lower-level characters. These Degrees of Success are also influenced by a trait on many encounter-ending abilities like dominate having the ' incapacitation ' trait, which protects higher level characters from getting anticlimactically one-shot by increasing their degree of success by one step on a save. 5e also includes protection against this via Legendary Resistances that powerful enemies often have, though this broader mechanism in Pathfinder 2e can also protect the party from lower-level creatures like ghouls getting lucky with paralysis by only happening on a critically failed fort save roll. Death and Dying One difference I've found unusually impactful is the initiative changing mechanics when a character gets knocked out and starts dying . In 5e the most dangerous initiative to roll is immediately after the boss, as such a character will need to roll a death saving throw at the start of their turn before their allies have a chance to help them. This character then likely loses their turn unless they roll a 20, so even if their allies manage to heal them it'll be the bosses turn again before they can act. In Pathfinder 2e however such a character would have their initiative changed to immediately before the boss's, guaranteeing the rest of the party a chance to help and that the character will get to take a turn if that help is granted. It really doesn't seem like a huge difference but removing the connection between relative initiative and rate of dying has saved characters more than a few times in my experience, and it protects against a very not fun combo of getting locked out of initiative by an opponent. Overall Pathfinder 2e and 5e share fundamental underlying principles but have substantial differences. Systematically there are many more rules for players and the GM to interact with based on the number of choices in character build and enormous quantity of options to choose from, in addition to the more thorough rules covering scenarios that 5e leaves broadly up to the DM. Stylistically there are differences in how adventuring parties are expected to act, to take some time resting between encounters and rely on each characters' skills more commonly than resolving the problem by spending a spell slot. Additionally players are more freely able to view and learn the rules without needing to commit much beyond their time.",
    "thread_id": "rpg-se-165473",
    "thread_title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/165473/what-are-the-major-differences-in-style-and-system-between-dd-5e-and-pathfinder#207786",
    "title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "post_type": "answer",
    "score": 16,
    "is_accepted": false
  },
  {
    "post_id": "a-207814",
    "author": "ESCE",
    "timestamp": "2023-08-17T16:54:28",
    "text": "I've played PF2e since about a month after it's release, and 5e for about a year before that. @brandon and @KRyan have phenomenal, valuable, and correct answers - I just have more to add that doesn't fit in a comment and seems too invasive for an edit. Please read their answers first - I only add things I find not covered in either answer. Regardless, Here are some of my observations, assuming no one is using alternate rules for either systems (important, since PF2e has several rules variants that'd affect this answer). Style Thematic Style PF2e is more \"super-heroic\" - basically everything scales directly with level, unlike 5e where things like AC notably don't. This means that a low-level goblin is more likely to hurt a higher level 5e character than PF2e character. 5e is significantly lower magic - while both have similar spellcasters, PF2e fundamentally relies on the players receiving a steady stream of magic items. The PCs having certain magic items by certain levels is a fundamental part of the math of PF2e, unlike 5e. A PC can invest in up to 10 magic items (not all magic items require investment) in PF2e, while they can only attune to 3 in 5e - and there's a way for the PF2e PC to get up to 12 . Genre-wise, PF2e feels more like \"fantasy superheroes\" - even martial characters have access to obviously superhuman abilities , like Cloud Jump , Fantastic Leap , or Friendly Toss . PF2e is generally designed with Golarion in mind (Pathfinder's home setting) instead of the Forgotten Realms. So there's differences in races (called ancestries in PF2e), monsters, deities, etc. 5e has tortles, loxodons, shape-shifting changelings; PF2e has leshies , ratfolk , and significantly less problematic lizardfolk lore. Gameplay Style PF2e has significantly more tactical combat . It's very rare that a certain build will auto-win a fight for you, and with the way things are balanced and scaled, combat requires more tactics. Part of this assumption is that, from what I've read, the standard metric of success in PF2e is ~50% (it's hard to find a true one because of how different proficiencies scale and such) while 5e's is 65%. RPGBot has good analysis on PF2e's math and 5e's math . Resultingly, PF2e assumes you are working together in combat . Flanking is a standard rule in the game, for example. Adventure Paths are tough enough that your party will need to work together or you'll have an exceedingly difficult time! Very few spells will outright win fights against significant foes (see brandon's note on the Incapacitation trait). (Note: if you want to GM PF2e and tone down the difficulty, that's actually trivially easy, so don't worry if you have a group that doesn't want to be tactical). PF2e has significantly more class and build variety (1st party at least), by way of having significantly more published content. There are currently 23 published classes, for example, and several with no true 5e equivalent (e.g. Kineticist). The class feat system also offers many more permutations of builds. Note that this is not an unalloyed good - if you don't have players you can trust to learn their characters and classes well, it takes a lot more effort for the GM to learn the character enough to help them. If I had more than one player who I didn't trust to learn their character, I'd just pass on PF2e (at least higher level play) for 5e. System They are different systems, and thus have a legions of differences. @brandon covers most of these well, so I'll add a few: Multiclassing is completely different - in 5e, you take levels in other classes. In PF2e, you always continue with your base class, but you can spend your class feats to (slowly) gain some features from an archetype , of which there is one for each other class (and very many non-class ones). PF2e buffs/debuffs in smaller values . 5e generally uses advantage and disadvantage for e.g. conditions and spell effects, whereas PF2e is much more likely to just give a +1 or +2. Consequently, you're generally doing more math in AC due to conditions. (Also, note that the degrees of success makes these smaller numbers more impactful in PF2e than 5e, by probably double). PF2e has versatile heritages , allowing for things like tiefling dwarves, aasimar elves, or beastkin leshies. 5e doesn't have a good equivalent. 5e has role-playing aids built into the character creation process in the form of Bonds, Ideals, and Flaws. PF2e currently doesn't have a good equivalent (I believe something may be coming down the line for the upcoming Remaster though) outside of alignment.",
    "thread_id": "rpg-se-165473",
    "thread_title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/165473/what-are-the-major-differences-in-style-and-system-between-dd-5e-and-pathfinder#207814",
    "title": "What are the major differences in style and system between D&amp;D 5e and Pathfinder 2e?",
    "post_type": "answer",
    "score": 7,
    "is_accepted": false
  },
  {
    "post_id": "q-156621",
    "author": "Amethyst Wizard",
    "timestamp": "2019-09-21T17:12:32",
    "text": "Pathfinder 2e came out more recently than D&D 5e, and there may be some similarities or influences that 5e has had on Pathfinder. Is the new Pathfinder edition more similar or less similar to D&D 5e than the prior Pathfinder edition? In other words, does Pathfinder 2e have more in common with D&D 5e than it does with Pathfinder 1e?",
    "thread_id": "rpg-se-156621",
    "thread_title": "Does Pathfinder 2e have more in common with D&amp;D 5e than it does with Pathfinder 1e?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/156621/does-pathfinder-2e-have-more-in-common-with-dd-5e-than-it-does-with-pathfinder",
    "title": "Does Pathfinder 2e have more in common with D&amp;D 5e than it does with Pathfinder 1e?",
    "post_type": "question",
    "score": 14
  },
  {
    "post_id": "a-156634",
    "author": "Quadratic Wizard",
    "timestamp": "2019-09-22T09:17:17",
    "text": "Pathfinder 2e is still more like Pathfinder 1e than D&D 5e The second edition of the Pathfinder rules does not draw very much at all from D&D 5th edition. If anything, there are a handful of influences from D&D 4th edition. Most of the changes between Pathfinder 1e and 2e are new features which don't appear in either 4e or 5e. Similarities to Pathfinder 1e rather than D&D 5e Races—now rather termed ancestries —still have ability score penalties. There are still three saving throws: Fortitude, Reflex and Will. Feats are still a standard mechanic. There is no Advantage/Disadvantage mechanic. Status effects inflict numeric penalties as normal for Pathfinder 1e or D&D 3.5. Material components are still consumed when casting a spell. Creature armor class can be very high at high levels; e.g. the balor's AC is 45, unlike D&D 5e where it is AC 19 because attack values are flatter. Characters still take a -5 penalty to each successive attack in a round, similar to D&D 3.5's iterative attacks. However, due to the action economy system, you can use successive attacks as successive Strike simple actions (you have up to 3 simple actions in one round) as soon as the first level, rather than when your character reaches BBA bonus of at least +6. Characters add their level to things in which they are proficient. The exact numbers have changed, but high level characters will still have +20 or more to attacks, saving throws, skill checks and so forth; unlike D&D 5e's flat number mechanics. Classes mainly specialize by feats rather than 5e-style subclasses. There are \"archetypes\", but these are just feats to customize or multiclass your character, and are not class-specific. Spellcasters still prepare and cast spells normally as in Pathfinder 1st edition. Similarities to D&D 5e Characters now have Backgrounds which grant skill proficiencies and other abilities. You can prepare a spell in a higher level slot to have greater effect, such as increased damage for fireball . The term \"proficiency\" is used to refer to all manner of d20-based rolls; however, one's proficiency bonus is not flat based on level like it is in 5e, but rather it varies based on class features and options. Nor does it use the flatter numbers of 5e, but usually adds the character's entire level to rolls. Cantrips (already at-will since Pathfinder 1e) now scale with caster level. Similarities to D&D 4e Character classes and such include summaries in three bullet points. Characters now have backgrounds, a feature introduced by D&D 4e, though made more famous by D&D 5e. Characters can perform up to three actions per turn, not entirely unlike 4e's Move/Minor/Standard, although Pathfinder's version works somewhat differently. Druids are considered \"Primal\" spellcasters rather than Divine. In a feature originally announced for D&D 4e but cut from the final version, Pathfinder 2e gives increased race-based abilities at higher levels. Characters have more hit points. You gain hit points from your ancestry (race) and a flat number of hit points per level. This means a level 1 character may start with 20 hit points like they can in D&D 4e. Unarmed strike deals 1d4 damage, rather than 1d3 (as in Pathfinder 1e) or 1 damage (as in D&D 5e).",
    "thread_id": "rpg-se-156621",
    "thread_title": "Does Pathfinder 2e have more in common with D&amp;D 5e than it does with Pathfinder 1e?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/156621/does-pathfinder-2e-have-more-in-common-with-dd-5e-than-it-does-with-pathfinder#156634",
    "title": "Does Pathfinder 2e have more in common with D&amp;D 5e than it does with Pathfinder 1e?",
    "post_type": "answer",
    "score": 25,
    "is_accepted": true
  },
  {
    "post_id": "q-176783",
    "author": "Jon Aristotle",
    "timestamp": "2020-10-23T22:32:00",
    "text": "Pathfinder's Step : You carefully move 5 feet. Unlike most types of movement, Stepping doesn’t trigger reactions, such as Attacks of Opportunity, that can be triggered by move actions or upon leaving or entering a square. You can’t Step into difficult terrain, and you can’t Step using a Speed other than your land Speed. DND 5e's Disengage : If you take the Disengage action, your Movement doesn’t provoke Opportunity Attacks for the rest of the turn. My intention would be to create for DND 5e something like: If you take the Step action, you can move 5 feet to an unoccupied space not in difficult terrain without triggering any opportunity attacks. This 5 feet is not considered part of your normal movement. As Disengage applies for a creature's full movement, I think giving the creature an extra 5 feet of movement when taking the Step action makes up for the loss. This would of course apply for NPCs and PCs, so I don't see this giving an unfair advantage to one group over the other, except for maybe those with the ability to disengage as a bonus action, like Goblins or Rogues; switching that for the Step action about may be a slight nerf to the class/creature/race. I find the Pathfinder Step makes more sense than the DND Disengage, as I can't make sense of Disengage working for more than the enemies directly threatening the character: a creature that takes the disengage action could then run there full movement, potentially avoiding a dozen or more attacks.",
    "thread_id": "rpg-se-176783",
    "thread_title": "Would there be a problem to incorporate Pathfinder-2e&#39;s &quot;Step&quot; action in place of DND 5e&#39;s &quot;Disengage&quot; action?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/176783/would-there-be-a-problem-to-incorporate-pathfinder-2es-step-action-in-place-o",
    "title": "Would there be a problem to incorporate Pathfinder-2e&#39;s &quot;Step&quot; action in place of DND 5e&#39;s &quot;Disengage&quot; action?",
    "post_type": "question",
    "score": 8
  },
  {
    "post_id": "a-176785",
    "author": "Exempt-Medic",
    "timestamp": "2020-10-24T00:39:45",
    "text": "The Step action is going to be mechanically worse than the Disengage action Moving 5 feet is a small benefit Personally, I don't believe moving an additional 5 feet is a significant benefit in most situations. Often that small extra distance won't change anything because your opponent is faster or was already slower or just has ranged attacks. The only time such a small benefit changes things is when your opponent prefers melee and would only just have reached you otherwise (this could also matter for just barely getting out of an AoE or similar region, though I can't imagine that coming up with any frequency). Not stopping all opportunity attacks is a large drawback One of the great benefits of the Disengage action is it stops all opportunity attacks, allowing you to step past and weave between numerous enemies. The Step action would not allow for this to occur anymore, which would be a significant loss of maneuverability and evasiveness for the small gain of only 5 feet of movement. Note, there is also the somewhat unusual case of XOX where X are enemies and O is a PC. In order to get away without provoking any Opportunity Attacks, O would have to move 5 feet North or South and then take the Step action and then continue moving: - - - - - - Initial Picture X O X - - - - O - Moving 5 Feet X - X - O - - - - Step Action X - X Similar to this are the following (and numerous others I've left out): X - X - O - X - X - X - X O - (This can be rotated) - X - X - - - O X (This can be rotated) X - - X - - - O X (This can be rotated) - X - In these scenarios, the Disengage action would allow the PC to fully escape, whereas the Step action (even combined with regular movement) would not. Thus there may be some changes to formations/tactics in battle if positioning in these ways is allowed. Step being worse than Disengage doesn't mean it won't work The fourth edition of D&D had a mechanic very similar to this Step action (though the action economy of 4e is a good bit different from 5e), so similar things have certainly been done; as has literally this exact mechanic (in the second edition of Pathfinder). Clearly then, it can (and has) worked. Additionally, you've said Step simply makes more sense to you, and if your table agrees with that and values realism, that's certainly a reason to use it instead of Disengage. I don't believe your game will break by switching out Disengage for Step I don't believe swapping an action out for one that is, in my opinion, worse has a meaningful chance of breaking your game. Features that grant Disengage as a bonus action would be somewhat worse, and any features that require or affect the Disengage action (assuming any exist) would have to be adjusted to fit the new Step action; but both of those are more bookkeeping issues than significant alterations to play. Three Words: Playtest, Playtest, Playtest At the end if the day, I believe playtesting will show best what effects this houserule can have, but I at least have not thought of any alarming changes this change would bring. That said, I'll certainly keep thinking about it over the next few days and add to this answer as I discover more nuance and quirks of the houserule.",
    "thread_id": "rpg-se-176783",
    "thread_title": "Would there be a problem to incorporate Pathfinder-2e&#39;s &quot;Step&quot; action in place of DND 5e&#39;s &quot;Disengage&quot; action?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/176783/would-there-be-a-problem-to-incorporate-pathfinder-2es-step-action-in-place-o#176785",
    "title": "Would there be a problem to incorporate Pathfinder-2e&#39;s &quot;Step&quot; action in place of DND 5e&#39;s &quot;Disengage&quot; action?",
    "post_type": "answer",
    "score": 20,
    "is_accepted": true
  },
  {
    "post_id": "q-170185",
    "author": "Ben R.",
    "timestamp": "2020-06-09T03:57:49",
    "text": "I'm a DM for a fifth edition D&D campaign. After discovering Pathfinder 2e earlier this year, I've been eager to give it a try with my regular group of players. I like the action economy and critical success/failure mechanics baked into the system. We started on 4e several years ago, and when 5e came out I was the one who proposed migrating. I'll be running a dungeon crawl, with a few social elements to give everyone a feel for how different aspects of the game work. I've used the pre-gen characters from Paizo's official 2e demo adventure as a base for the party. However, I've levelled everyone up to 5 (the party is lvl 4 in 5e), to give them all a little more versatility and options. One of the players will be playing the pre-gen universalist wizard, Ezren. This player is usually the most outspoken of the party when it comes to 5e game mechanics, having done a fair amount of DMing himself. \"I don't think this makes sense, we should try...\" sort of stuff. I've been open to a lot of it. When I explained how the wizard works, using Vancian magic and spells at specfic levels prepared into specific slots, his response was to the effect of \"that sounds stupid and restrictive.\" Are there any counters to this argument of restrictiveness I can give him to alleviate the negative bias that I'm sure he now has towards this upcoming playtest? So far I've told him that cantrips seem more potent than in 5e, as they're auto-heightened to be the same level as your highest level spell slot. I've also said that wizards in 2e get more spell slots in 5e, and I've given him the spell substitution thesis (which I had done before this interaction) for extra versatility. But I can't shake the feeling that he's right. Sorcerers in 2e get more spell slots of each level, can choose what they cast using what slots (unless I misunderstand their mechanics), automatically regain focus points without actively doing anything... 5e wizards could choose to cast the Fireball they'd prepared at level 5 instead of level 3, to give it a bit more oomph. His argument here was, in a clutch moment in a combat encounter, the wizard can't 'save the day' by doing so, if he hasn't prepared that spell in that slot. Wizards also don't get an equivalent to 5e's Arcane Recovery, to give them more slots than the 5e sorcerer. What arguments can I provide to counter his complaints about this restrictiveness?",
    "thread_id": "rpg-se-170185",
    "thread_title": "How do I address a player&#39;s complaint that Vancian spell preparation is too restrictive to make Wizards worth playing?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/170185/how-do-i-address-a-players-complaint-that-vancian-spell-preparation-is-too-rest",
    "title": "How do I address a player&#39;s complaint that Vancian spell preparation is too restrictive to make Wizards worth playing?",
    "post_type": "question",
    "score": 17
  },
  {
    "post_id": "a-170201",
    "author": "Szega",
    "timestamp": "2020-06-09T06:39:23",
    "text": "Spell Substitution PF2-wizards are unmatched in versatility out of combat In 5e a wizard can learn any number of spells and cast certain spells as rituals. This takes 10 minutes (+ original casting time) and you can do it even if the spell is not prepared. This does not cost a spell slot. A PF2 spell substitution wizard can also learn any number of spells, and they can cast ANY spell they know at any level in 10 minutes (+ original casting time), even if it is not prepared. This includes cantrips too. While in 5e this does not cost a spell slot, the ritual tag is rather rare. Even in contrast to that, the potential of spell substitution is VAST. As a wizard, you can learn any number of spells. Which, if you have coin and sense, means ALL of them. Situational spells that other classes would skip as inefficient are your bread and butter. Out of combat spending 10 minutes on a spell is usually much better than the alternative. For example, I substituted in spider climb to allow a party member to get down a cliff safely. Going around it or finding a better spot could have taken an hour or more. I did not have any idea that we will have to get down a cliff, but I didn't need to. In 5e you either had prepared spider climb or you did not, as it is not a ritual spell. Friendly tip: Prepare spells that you might need in a hurry (e.g. feather fall , fireball ). Do not bother with any spells with a casting time of 1min+, if you have that amount of time, you usually have 10 minutes to substitute it. A PF2 sorcerer fills a very different niche. I they want to cast a spell at a different level, they have to LEARN it at a different level, with the exception of their signature spells, which are limited in number. So while they are flexible within the level, they are quite restricted outside of it. For combat spells this is barely an issue, but most utility spells have qualitatively different effects when cast at different levels, making them waste either known spells or a signature spell to make use of them properly. Thus, if you want to play a combat mage, you will probably fare better as a sorcerer. If you look at magic as more of a tool than a weapon, go with wizard (of course, spell substitution is heavily recommended). The sorcerer will be able to spontaneously pull out their signature fireball at any time, but the wizard will be able to practically do so with spider climb , illusory object , comprehend languages , temporary tool , create food , shrink item , ... etc etc In response to your specific arguments PF2 wizards do get an equivalent of Arcane Recovery, called Arcane Bond / Drain Bonded Item. Its function is quite similar, allowing you to regain spent spell slots. Wizards have effectively the same number of slots as sorcerers. The wizard spell slots table on p.205 does not include the spell they can prepare from their Arcane School. If they do not have a school (a Universalist), they have a matching number of uses of Drain Bonded Item. Adding this +1 per spell level brings Universalists to the same number as sorcerers. Those with an Arcane School have 1 use of Drain Bonded Item on top of this.",
    "thread_id": "rpg-se-170185",
    "thread_title": "How do I address a player&#39;s complaint that Vancian spell preparation is too restrictive to make Wizards worth playing?",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/170185/how-do-i-address-a-players-complaint-that-vancian-spell-preparation-is-too-rest#170201",
    "title": "How do I address a player&#39;s complaint that Vancian spell preparation is too restrictive to make Wizards worth playing?",
    "post_type": "answer",
    "score": 18,
    "is_accepted": true
  },
  {
    "post_id": "q-166382",
    "author": "j&#233;r&#233;my leboeuf",
    "timestamp": "2020-03-14T21:13:39",
    "text": "is there some rules about the gold you can use when buying starting equipement at higher level. My character just died and i have to create a new one at level five. My Game master is fairly new to the task and we got a debate about if you can use the extra 500+ 1d10x25 Gold piece you get in the starting equipement tab for buying starting equipement or not. (Page 36 dungeon master's guide) My Game master doesn't know, and two of our players are arguing about a rule in the books that apparently mention that even at higher level you can only buy the starting equipement with the starting wealth by classe tab and not with any extra gold wathever the origine of it is even the starting equipement tab mentioned before. (player's handbook p. 143). I've tried to find it in the Dungeon master's guide and online but could'nt find anythings about it. Even here the post about the starting equipement that i found doesn't mantion anything about it. thanks for the light that you can bring in this zone of shadow.",
    "thread_id": "rpg-se-166382",
    "thread_title": "Is there a rule in DnD 5e when buying starting equipement at higher level (lvl5 and higher)",
    "forum_section": "RPG Stack Exchange",
    "url": "https://rpg.stackexchange.com/questions/166382/is-there-a-rule-in-dnd-5e-when-buying-starting-equipement-at-higher-level-lvl5",
    "title": "Is there a rule in DnD 5e when buying starting equipement at higher level (lvl5 and higher)",
    "post_type": "question",
    "score": 2
  }
]